app/controllers/courses_controller.rb

	def index
       @courses=Course.all
---
SELECT "courses".* FROM "courses" WHERE (teacher like '%小綠%')

	def create

     @course=Course.new(course_params)
	if @course.save
---
INSERT INTO "courses" ("title", "teacher", "time", "classroom", "credit", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "123"], ["teacher", "123"], ["time", "123"], ["classroom", "123"], ["credit", "123"], ["created_at", "2015-04-07 13:28:28.086942"], ["updated_at", "2015-04-07 13:28:28.086942"]]

    def update
	@course=Course.find(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]